Courses/7140/Lectures/Testing/index.org
# -*- mode: org -*-
#+DATE: 2018-10-22
#+TITLE: Software Testing
#+AUTHOR: Prabhaker Mateti
#+DESCRIPTION: CS7140 Adv Software Engineering
#+HTML_LINK_UP: ../
#+HTML_LINK_HOME: ../../Top/index.html
#+HTML_HEAD: <style> P {text-align: justify} code, pre {color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "<a href=\"../../\"> ../../</a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2018 &bull; <a href=\"http://www.wright.edu/~pmateti\"> www.wright.edu/~pmateti</a>  %d"))
#+STARTUP:showeverything
#+OPTIONS: toc:nil

[Landing]

*  Overview

1. A Famous Quote: "Testing shows the presence, not the absence, of
   bugs" – Edsger W. Dijkstra, 1969, Turning Award Winner 1972

3. Goals of Software Testing
4. Goals of Debugging
1. [[../Testing/overview.html][Definition of a "Test"]]
1. Test Generation and Test Coverage
1. Equivalence Class Testing
1. [[../Testing/overview.html][Overview/Goals]] all the above

* Unit Testing

1. What is a Unit?  A "piece" of source code. Function, Procedure,
   Method, Class, ...
1. JUnit https://junit.org/junit5/  JUnit is included in IDEA

1. TestNG  https://testng.org/doc/idea.html TestNG is included in IDEA

1. [[./testing-units.org]] all the above

* Integration Testing

1. Test (all) the units together.  It occurs after unit testing and
   before validation testing.

1. It is fairly common that even after successful unit testing of all
   units, integration testing fails.

1. [[./testing-integrated.org]] all the above

* Mutation Testing

1. Mutation testing evaluates the quality of existing software tests.
   Mutation minorly modifies a program under test, and then applies a
   test suite.

1. [[./mutation.org]] all the above

* References

2. http://en.wikipedia.org/wiki/Mutation_testing  Required Reading.

1. http://courses.cs.washington.edu/courses/cse331/16wi/L08/L08-Testing.pdf
   40+ slides.  Recommended Reading.

1. Several slides are noted in the refs of [[../Testing/overview.html][Overview/Goals]] 


* End
# Local variables:
# after-save-hook: org-html-export-to-html
# end:
