Courses/7140/Lectures/Testing/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Software Testing</title>
<!-- 2018-10-23 Tue 17:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CS7140 Adv Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Software Testing</h1>
<p>
[Landing]
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>A Famous Quote: "Testing shows the presence, not the absence, of
bugs" – Edsger W. Dijkstra, 1969, Turning Award Winner 1972
</li>

<li>Goals of Software Testing
</li>
<li>Goals of Debugging
</li>
<li><a href="../Testing/overview.html">Definition of a "Test"</a>
</li>
<li>Test Generation and Test Coverage
</li>
<li>Equivalence Class Testing
</li>
<li><a href="../Testing/overview.html">Overview/Goals</a> all the above
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Unit Testing</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>What is a Unit?  A "piece" of source code. Function, Procedure,
Method, Class, &#x2026;
</li>
<li>JUnit <a href="https://junit.org/junit5/">https://junit.org/junit5/</a>  JUnit is included in IDEA
</li>

<li>TestNG  <a href="https://testng.org/doc/idea.html">https://testng.org/doc/idea.html</a> TestNG is included in IDEA
</li>

<li><a href="./testing-units.html">./testing-units.html</a> all the above
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Integration Testing</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Test (all) the units together.  It occurs after unit testing and
before validation testing.
</li>

<li>It is fairly common that even after successful unit testing of all
units, integration testing fails.
</li>

<li><a href="./testing-integrated.html">./testing-integrated.html</a> all the above
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Mutation Testing</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Mutation testing evaluates the quality of existing software tests.
Mutation minorly modifies a program under test, and then applies a
test suite.
</li>

<li><a href="./mutation.html">./mutation.html</a> all the above
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="http://en.wikipedia.org/wiki/Mutation_testing">http://en.wikipedia.org/wiki/Mutation_testing</a>  Required Reading.
</li>

<li><a href="http://courses.cs.washington.edu/courses/cse331/16wi/L08/L08-Testing.pdf">http://courses.cs.washington.edu/courses/cse331/16wi/L08/L08-Testing.pdf</a>
   40+ slides.  Recommended Reading.
</li>

<li>Several slides are noted in the refs of <a href="../Testing/overview.html">Overview/Goals</a> 
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2018-10-22
</div>
</body>
</html>
